'use client'

import React from 'react'

export default function TermsOfService() {
  return (
    <div>
      <div className="p-6 rounded-lg ring-2 ring-gray-200 shadow-lg">
        <h1 className="text-2xl font-bold mb-5 text-[#265FFD]">服务条款</h1>
        <div className="space-y-4">
          <div className="space-y-2">
            <p className="font-semibold text-xl text-[#265FFD]">
              【重要必读】本站会员行使权利义务公告
            </p>
            <ul className="pl-3">
              <br />
              <li>
                1.
                会员进入本站参与任何活动前，请务必详细阅读本公司之各项规定，一经「同意」进入本网站后，即被视为已接受所有规定。
              </li>
              <br />
              <li>2. 本公司保留修改本协议任何条款之权力，并拥有最终解释及裁决权。</li>
              <br />
              <li>3. 本网站只向符合法定年龄的用户提供服务，客户在进行游戏时必须年满18岁。</li>
              <br />
              <li> 4. 注意!!凡发现相同IP有多个账号以上，将立即停止受理所有点数交易！</li>
              <br />
              <li>
                5.
                因人为或系统发生不可预测因素所导致的失误，本公司仅以会员「游戏记录」之内容作为计算结果依据，本公司管理层保留最终裁定权。
              </li>
              <br />
              <li>
                6.
                如遇不可抗拒之灾害，如黑客入侵、网络问题、系统损毁造成数据丢失之情况，以本网站最终数据为最后的处理数据，本公司保留修改最终结果之权力。
              </li>
              <br />
              <li>
                7.
                为保障您的账号安全请勿告知他人账号密码交予他人使用，切勿因贪图方便将密码设置过于简单导致被破解造成不必要的损失，请妥善保存个人密码，定期变更密码，不要使用网页记忆密码的功能。
              </li>
              <br />
              <p className="font-semibold text-xl text-[#265FFD]">各位会员敬请注意</p>
              <br />
              <li>
                1.
                于本网站首次交易前，请主动与在线客服做实名认证，只需做一次认证即可。为加速您点数交易的处理时间，还请各位会员踊跃进行认证。
              </li>
              <br />
              <li>
                2.
                每个会员只能拥有一个账号及一个IP，如发现会员拥有多个账号，亦或经查会员账号使用多个IP同时游戏，本公司有权冻结会员账号以及取消该账号内所有胜出的游戏，本公司有权保留取消任何因素导致账号余额不正确的金额。此外如发现账号持有人与亲属共同使用多个不同账号，本公司有权限制会员每人各保留最多一个账号。
              </li>
              <br />
              <li>
                3.
                本公司举办优惠活动通则：只限用于同一玩家、同一联系方式、同一IP以及同一台电脑参加。不正常的游戏行为，本公司有权没收盈利。同一账户
                / 家庭 / 户籍地址 / 邮箱地址 / 电话号码 / 付款账号 (如信用卡号等等) / IP位置 /
                共享电脑 / 环境网络 ※IP显示异常者预防性制止刷点 / 诈骗行为 / 产生盈利不列入计算。
              </li>
              <br />
              <li>
                4.
                为维护游戏公平，如审核发现会员在同一局同时游戏正反两种结果或利用非法软件进行游戏时，将取消其游戏期间所产生的盈利及优惠（胜败由会员自行承担），如发现此类游戏的玩家将会取消会员资格，注销其游戏账号。感谢您的支持。
              </li>
              <br />
              <li>
                5.
                为避免任何争议，每次登录及离开时，客户都应核对自己的游戏币，各用户在参与本网站所有游戏过程中或在结束游戏前，务必检查该会员账户的资料，如发现任何异常情况，应立即与客服联系查证，否则该用户将被视为同意并且接受，其账户之一切数据或历史数据，以本公司数据库中的数据为准，用户不得异议。
              </li>
              <br />
              <li>
                6.
                本公司有权拒绝或不接受任何用户以任何不正当方式登录或参与本网站所有游戏的权利，恶意通过游戏网站程序漏洞，使用外挂程序或擅自修改所获取的不当游戏币、积分，经查证属实者，本公司将立即对该用户永久停权，非法所得之游戏币、积分将不予计算，且本公司将保留法律追溯权。
              </li>
              <br />
              <li>
                7.
                若经查证以不同账户转账或于不同县市进行超商储值之诈骗洗点嫌疑，若使用本公司之储值系统对外进行诈骗，本公司将会进行冻结或终止账户并依法交付相关会员资料与当地刑事侦办。会员请勿以身试法！
              </li>
              <br />
              <li>
                8.
                使用虚拟货币储值仅限于USDT（泰达币），如用其他虚拟货币进行储值一概不退回。会员请勿以身试法！
              </li>
              <br />
              <li>
                9.
                近期发现有非法套利集团在恶意攻击本平台刷点的动作，已违反本公司规定，近期会请工程部严格查核，为了避免套利集团使用本平台刷点，本公司一律发现IP异常的账户，将不得抛售并且锁定IP黑名单及冻结账户，并且退还最后一笔储值，退款手续费须由会员方承担，为了给各位贵宾良好的游戏环境，所以请各位贵宾遵守规定，谢谢。
              </li>
              <br />
              <li>
                10.
                本公司严禁旗下代理或工作人员私自开办注册账号，进行游戏行为，如有发现此违规行为，将进行封号停权并禁止一切操作行为（所有点数都将冻结不得再做使用）。
              </li>
              <br />
              <li>
                11.
                如有下线会员与代理商同IP的情况，我们视为代理商自己开设会员游戏，属于违规行为，将永久冻结账户，同IP出现多个会员的话，将被视为无效会员。
              </li>
              <br />
              <li>
                12.
                如因软件或线路问题而导致交易内容或其它与账号设定不符合的情形，请于开赛前及滚球游戏记录未有实际结果前“立即”联系本公司反映问题，否则该交易会员必须同意以本公司数据库中的数据为准。
              </li>
              <br />
              <li>
                13.
                若经本公司发现会员以不正当手法进行交易而交易游戏记录内容不正常或于同一项项目传送多次相同游戏记录，本公司将保留“取消”该非正常游戏记录或只保留一张游戏记录之权利。
              </li>
              <br />
              <li>
                14.
                本公司保留判定任何涉嫌以任何非正常方式进行的个人或团体交易无效之权利，并将进行进一步调查期间停止发放彩金。
              </li>
              <br />
              <li>15. 本公司保留“拒绝交易”“提高/降低某些赛事单注最高金额”并不做任何解释的权利。</li>
              <br />
              <li>
                16.
                为避免纠纷，各会员在交易之后，务必进入交易状况检查，若发现任何异常，请立即与代理商联系查证，否则交易会员必须同意，一切交易历史将以本公司数据库中数据为准，不得异议。
              </li>
              <br />
              <li>
                17.
                报表项目：有效金额是指交易金额扣除（1）取消之游戏记录（2）平手之游戏记录（3）胜败一半游戏记录的50%所得之实际有效交易金额。
              </li>
              <br />
              <li>18. 如发现任何恶意套利行为，平台将扣除所有余额，并且有权冻结其账号。</li>
              <br />
              <li>
                19.
                不得允许任何其他人或第三方，包括任何未成年人使用或重复使用您的账号进行任何网站访问及游戏操作，若使用VPN或不同设备登录导致行为异常，系统会自行判定风险。本公司将有权拒绝支付由此产生的任何奖励或奖金。您将独自为第三方在账户中产生的所有损失负责。
              </li>
            </ul>
          </div>
        </div>
      </div>
      <div className="p-6 rounded-lg ring-2 ring-gray-200 shadow-lg mt-6">
        <div className="space-y-4">
          <div className="space-y-2">
            <ul className="pl-3">
              <p className="text-2xl font-bold mb-5 text-[#265FFD]">平台游戏规则限定</p>
              <p>
                为了本公司VIP客户游戏体验，公司有权调整VIP客户游戏限红额度，但此调整仅限娱乐性质，若经发现有不正常游戏行为（倍投或无风险游戏等，请参照以下说明），本公司亦有权利在不通知的情况下将限红调降。
              </p>
              <br />
              <li>• 无风险游戏 </li>
              <br />
              <li>
                1.
                同一场次同一车位最多只能游戏7个不同号码，同一号码最多只能游戏7个不同车位，并且最多只能购买7个不同车位，超过的属于8码的是无风险游戏。
              </li>
              <br />
              <li>
                2.
                同一期中禁止对打对冲，秒速飞艇冠、亚和不论是大小、单双只能购买一个，两面盘大小，单双龙虎只能购买一个，禁止刷超7码，冠亚和值最多不可以超过11个。如发现有进行对打对冲无论胜败不予计算。
              </li>
              <br />
              <li>
                3.
                为保障您的账号安全请勿告知他人账号密码交予他人使用，切勿因贪图方便将密码设置过于简单导致被破解造成不必要的损失，请妥善保存个人密码，定期变更密码，不要使用网页记忆密码的功能。
              </li>
              <br />
              <li>
                4. 本公司对于（美棒 篮球 日棒、韩棒
                足球等各项赛事）打分洞、团体游戏、外挂程序之行为者，不论比赛是否派彩，对于上述公告本公司将一律删除游戏记录，敬请会员留意！切勿以身试法！按公司规则判定胜败。
              </li>
              <br />
              <li>5. 不定期举办优惠赠点活动，请多加利用优惠活动页面或与在线客服聊聊。</li>
            </ul>
          </div>
        </div>
      </div>
    </div>
  )
}
